Revit 2027 API
Space.CalculatedHeatingLoad Property
Get the Calculated Heating Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CalculatedHeatingLoad { get; }
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
public:
property double CalculatedHeatingLoad {
	double get ();
}
member CalculatedHeatingLoad : float with get
Property Value
Double
Remarks
This property is used to get the Calculated Heating Load of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace